espressif/esp-idf/components/soc/esp32h4/register/soc/hp_mem_apm_reg.h
/** HP_MEM_APM_REGION1_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION1_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x14)
/** HP_MEM_APM_REGION1_ADDR_END_L : HRO; bitpos: [11:0]; default: 4095;
 *  Low 12 bit, end address of region 1.
 */
#define HP_MEM_APM_REGION1_ADDR_END_L    0x00000FFFU
#define HP_MEM_APM_REGION1_ADDR_END_L_M  (HP_MEM_APM_REGION1_ADDR_END_L_V << HP_MEM_APM_REGION1_ADDR_END_L_S)
#define HP_MEM_APM_REGION1_ADDR_END_L_V  0x00000FFFU
#define HP_MEM_APM_REGION1_ADDR_END_L_S  0
/** HP_MEM_APM_REGION1_ADDR_END : R/W; bitpos: [18:12]; default: 127;
 *  Configures end address of region 1.
 */
#define HP_MEM_APM_REGION1_ADDR_END    0x0000007FU
#define HP_MEM_APM_REGION1_ADDR_END_M  (HP_MEM_APM_REGION1_ADDR_END_V << HP_MEM_APM_REGION1_ADDR_END_S)
#define HP_MEM_APM_REGION1_ADDR_END_V  0x0000007FU
#define HP_MEM_APM_REGION1_ADDR_END_S  12
/** HP_MEM_APM_REGION1_ADDR_END_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  end address of region 1.
 */
#define HP_MEM_APM_REGION1_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION1_ADDR_END_H_M  (HP_MEM_APM_REGION1_ADDR_END_H_V << HP_MEM_APM_REGION1_ADDR_END_H_S)
#define HP_MEM_APM_REGION1_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION1_ADDR_END_H_S  19

/** HP_MEM_APM_REGION1_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION1_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x18)
/** HP_MEM_APM_REGION1_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 1.
 */
#define HP_MEM_APM_REGION1_R0_X    (BIT(0))
#define HP_MEM_APM_REGION1_R0_X_M  (HP_MEM_APM_REGION1_R0_X_V << HP_MEM_APM_REGION1_R0_X_S)
#define HP_MEM_APM_REGION1_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION1_R0_X_S  0
/** HP_MEM_APM_REGION1_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 1.
 */
#define HP_MEM_APM_REGION1_R0_W    (BIT(1))
#define HP_MEM_APM_REGION1_R0_W_M  (HP_MEM_APM_REGION1_R0_W_V << HP_MEM_APM_REGION1_R0_W_S)
#define HP_MEM_APM_REGION1_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION1_R0_W_S  1
/** HP_MEM_APM_REGION1_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 1.
 */
#define HP_MEM_APM_REGION1_R0_R    (BIT(2))
#define HP_MEM_APM_REGION1_R0_R_M  (HP_MEM_APM_REGION1_R0_R_V << HP_MEM_APM_REGION1_R0_R_S)
#define HP_MEM_APM_REGION1_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION1_R0_R_S  2
/** HP_MEM_APM_REGION1_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 1.
 */
#define HP_MEM_APM_REGION1_R1_X    (BIT(4))
#define HP_MEM_APM_REGION1_R1_X_M  (HP_MEM_APM_REGION1_R1_X_V << HP_MEM_APM_REGION1_R1_X_S)
#define HP_MEM_APM_REGION1_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION1_R1_X_S  4
/** HP_MEM_APM_REGION1_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 1.
 */
#define HP_MEM_APM_REGION1_R1_W    (BIT(5))
#define HP_MEM_APM_REGION1_R1_W_M  (HP_MEM_APM_REGION1_R1_W_V << HP_MEM_APM_REGION1_R1_W_S)
#define HP_MEM_APM_REGION1_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION1_R1_W_S  5
/** HP_MEM_APM_REGION1_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 1.
 */
#define HP_MEM_APM_REGION1_R1_R    (BIT(6))
#define HP_MEM_APM_REGION1_R1_R_M  (HP_MEM_APM_REGION1_R1_R_V << HP_MEM_APM_REGION1_R1_R_S)
#define HP_MEM_APM_REGION1_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION1_R1_R_S  6
/** HP_MEM_APM_REGION1_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 1.
 */
#define HP_MEM_APM_REGION1_R2_X    (BIT(8))
#define HP_MEM_APM_REGION1_R2_X_M  (HP_MEM_APM_REGION1_R2_X_V << HP_MEM_APM_REGION1_R2_X_S)
#define HP_MEM_APM_REGION1_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION1_R2_X_S  8
/** HP_MEM_APM_REGION1_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 1.
 */
#define HP_MEM_APM_REGION1_R2_W    (BIT(9))
#define HP_MEM_APM_REGION1_R2_W_M  (HP_MEM_APM_REGION1_R2_W_V << HP_MEM_APM_REGION1_R2_W_S)
#define HP_MEM_APM_REGION1_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION1_R2_W_S  9
/** HP_MEM_APM_REGION1_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 1.
 */
#define HP_MEM_APM_REGION1_R2_R    (BIT(10))
#define HP_MEM_APM_REGION1_R2_R_M  (HP_MEM_APM_REGION1_R2_R_V << HP_MEM_APM_REGION1_R2_R_S)
#define HP_MEM_APM_REGION1_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION1_R2_R_S  10
/** HP_MEM_APM_REGION1_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION1_LOCK    (BIT(11))
#define HP_MEM_APM_REGION1_LOCK_M  (HP_MEM_APM_REGION1_LOCK_V << HP_MEM_APM_REGION1_LOCK_S)
#define HP_MEM_APM_REGION1_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION1_LOCK_S  11

/** HP_MEM_APM_REGION2_ADDR_START_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION2_ADDR_START_REG (DR_REG_HP_MEM_APM_BASE + 0x1c)
/** HP_MEM_APM_REGION2_ADDR_START_L : HRO; bitpos: [11:0]; default: 0;
 *  Low 12 bit, start address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_START_L    0x00000FFFU
#define HP_MEM_APM_REGION2_ADDR_START_L_M  (HP_MEM_APM_REGION2_ADDR_START_L_V << HP_MEM_APM_REGION2_ADDR_START_L_S)
#define HP_MEM_APM_REGION2_ADDR_START_L_V  0x00000FFFU
#define HP_MEM_APM_REGION2_ADDR_START_L_S  0
/** HP_MEM_APM_REGION2_ADDR_START : R/W; bitpos: [18:12]; default: 0;
 *  Configures start address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_START    0x0000007FU
#define HP_MEM_APM_REGION2_ADDR_START_M  (HP_MEM_APM_REGION2_ADDR_START_V << HP_MEM_APM_REGION2_ADDR_START_S)
#define HP_MEM_APM_REGION2_ADDR_START_V  0x0000007FU
#define HP_MEM_APM_REGION2_ADDR_START_S  12
/** HP_MEM_APM_REGION2_ADDR_START_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  start address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_START_H    0x00001FFFU
#define HP_MEM_APM_REGION2_ADDR_START_H_M  (HP_MEM_APM_REGION2_ADDR_START_H_V << HP_MEM_APM_REGION2_ADDR_START_H_S)
#define HP_MEM_APM_REGION2_ADDR_START_H_V  0x00001FFFU
#define HP_MEM_APM_REGION2_ADDR_START_H_S  19

/** HP_MEM_APM_REGION2_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION2_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x20)
/** HP_MEM_APM_REGION2_ADDR_END_L : HRO; bitpos: [11:0]; default: 4095;
 *  Low 12 bit, end address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_END_L    0x00000FFFU
#define HP_MEM_APM_REGION2_ADDR_END_L_M  (HP_MEM_APM_REGION2_ADDR_END_L_V << HP_MEM_APM_REGION2_ADDR_END_L_S)
#define HP_MEM_APM_REGION2_ADDR_END_L_V  0x00000FFFU
#define HP_MEM_APM_REGION2_ADDR_END_L_S  0
/** HP_MEM_APM_REGION2_ADDR_END : R/W; bitpos: [18:12]; default: 127;
 *  Configures end address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_END    0x0000007FU
#define HP_MEM_APM_REGION2_ADDR_END_M  (HP_MEM_APM_REGION2_ADDR_END_V << HP_MEM_APM_REGION2_ADDR_END_S)
#define HP_MEM_APM_REGION2_ADDR_END_V  0x0000007FU
#define HP_MEM_APM_REGION2_ADDR_END_S  12
/** HP_MEM_APM_REGION2_ADDR_END_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  end address of region 2.
 */
#define HP_MEM_APM_REGION2_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION2_ADDR_END_H_M  (HP_MEM_APM_REGION2_ADDR_END_H_V << HP_MEM_APM_REGION2_ADDR_END_H_S)
#define HP_MEM_APM_REGION2_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION2_ADDR_END_H_S  19

/** HP_MEM_APM_REGION2_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION2_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x24)
/** HP_MEM_APM_REGION2_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 2.
 */
#define HP_MEM_APM_REGION2_R0_X    (BIT(0))
#define HP_MEM_APM_REGION2_R0_X_M  (HP_MEM_APM_REGION2_R0_X_V << HP_MEM_APM_REGION2_R0_X_S)
#define HP_MEM_APM_REGION2_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION2_R0_X_S  0
/** HP_MEM_APM_REGION2_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 2.
 */
#define HP_MEM_APM_REGION2_R0_W    (BIT(1))
#define HP_MEM_APM_REGION2_R0_W_M  (HP_MEM_APM_REGION2_R0_W_V << HP_MEM_APM_REGION2_R0_W_S)
#define HP_MEM_APM_REGION2_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION2_R0_W_S  1
/** HP_MEM_APM_REGION2_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 2.
 */
#define HP_MEM_APM_REGION2_R0_R    (BIT(2))
#define HP_MEM_APM_REGION2_R0_R_M  (HP_MEM_APM_REGION2_R0_R_V << HP_MEM_APM_REGION2_R0_R_S)
#define HP_MEM_APM_REGION2_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION2_R0_R_S  2
/** HP_MEM_APM_REGION2_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 2.
 */
#define HP_MEM_APM_REGION2_R1_X    (BIT(4))
#define HP_MEM_APM_REGION2_R1_X_M  (HP_MEM_APM_REGION2_R1_X_V << HP_MEM_APM_REGION2_R1_X_S)
#define HP_MEM_APM_REGION2_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION2_R1_X_S  4
/** HP_MEM_APM_REGION2_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 2.
 */
#define HP_MEM_APM_REGION2_R1_W    (BIT(5))
#define HP_MEM_APM_REGION2_R1_W_M  (HP_MEM_APM_REGION2_R1_W_V << HP_MEM_APM_REGION2_R1_W_S)
#define HP_MEM_APM_REGION2_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION2_R1_W_S  5
/** HP_MEM_APM_REGION2_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 2.
 */
#define HP_MEM_APM_REGION2_R1_R    (BIT(6))
#define HP_MEM_APM_REGION2_R1_R_M  (HP_MEM_APM_REGION2_R1_R_V << HP_MEM_APM_REGION2_R1_R_S)
#define HP_MEM_APM_REGION2_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION2_R1_R_S  6
/** HP_MEM_APM_REGION2_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 2.
 */
#define HP_MEM_APM_REGION2_R2_X    (BIT(8))
#define HP_MEM_APM_REGION2_R2_X_M  (HP_MEM_APM_REGION2_R2_X_V << HP_MEM_APM_REGION2_R2_X_S)
#define HP_MEM_APM_REGION2_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION2_R2_X_S  8
/** HP_MEM_APM_REGION2_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 2.
 */
#define HP_MEM_APM_REGION2_R2_W    (BIT(9))
#define HP_MEM_APM_REGION2_R2_W_M  (HP_MEM_APM_REGION2_R2_W_V << HP_MEM_APM_REGION2_R2_W_S)
#define HP_MEM_APM_REGION2_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION2_R2_W_S  9
/** HP_MEM_APM_REGION2_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 2.
 */
#define HP_MEM_APM_REGION2_R2_R    (BIT(10))
#define HP_MEM_APM_REGION2_R2_R_M  (HP_MEM_APM_REGION2_R2_R_V << HP_MEM_APM_REGION2_R2_R_S)
#define HP_MEM_APM_REGION2_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION2_R2_R_S  10
/** HP_MEM_APM_REGION2_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION2_LOCK    (BIT(11))
#define HP_MEM_APM_REGION2_LOCK_M  (HP_MEM_APM_REGION2_LOCK_V << HP_MEM_APM_REGION2_LOCK_S)
#define HP_MEM_APM_REGION2_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION2_LOCK_S  11

/** HP_MEM_APM_REGION3_ADDR_START_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION3_ADDR_START_REG (DR_REG_HP_MEM_APM_BASE + 0x28)
/** HP_MEM_APM_REGION3_ADDR_START_L : HRO; bitpos: [11:0]; default: 0;
 *  Low 12 bit, start address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_START_L    0x00000FFFU
#define HP_MEM_APM_REGION3_ADDR_START_L_M  (HP_MEM_APM_REGION3_ADDR_START_L_V << HP_MEM_APM_REGION3_ADDR_START_L_S)
#define HP_MEM_APM_REGION3_ADDR_START_L_V  0x00000FFFU
#define HP_MEM_APM_REGION3_ADDR_START_L_S  0
/** HP_MEM_APM_REGION3_ADDR_START : R/W; bitpos: [18:12]; default: 0;
 *  Configures start address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_START    0x0000007FU
#define HP_MEM_APM_REGION3_ADDR_START_M  (HP_MEM_APM_REGION3_ADDR_START_V << HP_MEM_APM_REGION3_ADDR_START_S)
#define HP_MEM_APM_REGION3_ADDR_START_V  0x0000007FU
#define HP_MEM_APM_REGION3_ADDR_START_S  12
/** HP_MEM_APM_REGION3_ADDR_START_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  start address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_START_H    0x00001FFFU
#define HP_MEM_APM_REGION3_ADDR_START_H_M  (HP_MEM_APM_REGION3_ADDR_START_H_V << HP_MEM_APM_REGION3_ADDR_START_H_S)
#define HP_MEM_APM_REGION3_ADDR_START_H_V  0x00001FFFU
#define HP_MEM_APM_REGION3_ADDR_START_H_S  19

/** HP_MEM_APM_REGION3_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION3_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x2c)
/** HP_MEM_APM_REGION3_ADDR_END_L : HRO; bitpos: [11:0]; default: 4095;
 *  Low 12 bit, end address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_END_L    0x00000FFFU
#define HP_MEM_APM_REGION3_ADDR_END_L_M  (HP_MEM_APM_REGION3_ADDR_END_L_V << HP_MEM_APM_REGION3_ADDR_END_L_S)
#define HP_MEM_APM_REGION3_ADDR_END_L_V  0x00000FFFU
#define HP_MEM_APM_REGION3_ADDR_END_L_S  0
/** HP_MEM_APM_REGION3_ADDR_END : R/W; bitpos: [18:12]; default: 127;
 *  Configures end address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_END    0x0000007FU
#define HP_MEM_APM_REGION3_ADDR_END_M  (HP_MEM_APM_REGION3_ADDR_END_V << HP_MEM_APM_REGION3_ADDR_END_S)
#define HP_MEM_APM_REGION3_ADDR_END_V  0x0000007FU
#define HP_MEM_APM_REGION3_ADDR_END_S  12
/** HP_MEM_APM_REGION3_ADDR_END_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  end address of region 3.
 */
#define HP_MEM_APM_REGION3_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION3_ADDR_END_H_M  (HP_MEM_APM_REGION3_ADDR_END_H_V << HP_MEM_APM_REGION3_ADDR_END_H_S)
#define HP_MEM_APM_REGION3_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION3_ADDR_END_H_S  19

/** HP_MEM_APM_REGION3_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION3_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x30)
/** HP_MEM_APM_REGION3_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 3.
 */
#define HP_MEM_APM_REGION3_R0_X    (BIT(0))
#define HP_MEM_APM_REGION3_R0_X_M  (HP_MEM_APM_REGION3_R0_X_V << HP_MEM_APM_REGION3_R0_X_S)
#define HP_MEM_APM_REGION3_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION3_R0_X_S  0
/** HP_MEM_APM_REGION3_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 3.
 */
#define HP_MEM_APM_REGION3_R0_W    (BIT(1))
#define HP_MEM_APM_REGION3_R0_W_M  (HP_MEM_APM_REGION3_R0_W_V << HP_MEM_APM_REGION3_R0_W_S)
#define HP_MEM_APM_REGION3_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION3_R0_W_S  1
/** HP_MEM_APM_REGION3_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 3.
 */
#define HP_MEM_APM_REGION3_R0_R    (BIT(2))
#define HP_MEM_APM_REGION3_R0_R_M  (HP_MEM_APM_REGION3_R0_R_V << HP_MEM_APM_REGION3_R0_R_S)
#define HP_MEM_APM_REGION3_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION3_R0_R_S  2
/** HP_MEM_APM_REGION3_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 3.
 */
#define HP_MEM_APM_REGION3_R1_X    (BIT(4))
#define HP_MEM_APM_REGION3_R1_X_M  (HP_MEM_APM_REGION3_R1_X_V << HP_MEM_APM_REGION3_R1_X_S)
#define HP_MEM_APM_REGION3_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION3_R1_X_S  4
/** HP_MEM_APM_REGION3_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 3.
 */
#define HP_MEM_APM_REGION3_R1_W    (BIT(5))
#define HP_MEM_APM_REGION3_R1_W_M  (HP_MEM_APM_REGION3_R1_W_V << HP_MEM_APM_REGION3_R1_W_S)
#define HP_MEM_APM_REGION3_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION3_R1_W_S  5
/** HP_MEM_APM_REGION3_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 3.
 */
#define HP_MEM_APM_REGION3_R1_R    (BIT(6))
#define HP_MEM_APM_REGION3_R1_R_M  (HP_MEM_APM_REGION3_R1_R_V << HP_MEM_APM_REGION3_R1_R_S)
#define HP_MEM_APM_REGION3_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION3_R1_R_S  6
/** HP_MEM_APM_REGION3_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 3.
 */
#define HP_MEM_APM_REGION3_R2_X    (BIT(8))
#define HP_MEM_APM_REGION3_R2_X_M  (HP_MEM_APM_REGION3_R2_X_V << HP_MEM_APM_REGION3_R2_X_S)
#define HP_MEM_APM_REGION3_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION3_R2_X_S  8
/** HP_MEM_APM_REGION3_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 3.
 */
#define HP_MEM_APM_REGION3_R2_W    (BIT(9))
#define HP_MEM_APM_REGION3_R2_W_M  (HP_MEM_APM_REGION3_R2_W_V << HP_MEM_APM_REGION3_R2_W_S)
#define HP_MEM_APM_REGION3_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION3_R2_W_S  9
/** HP_MEM_APM_REGION3_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 3.
 */
#define HP_MEM_APM_REGION3_R2_R    (BIT(10))
#define HP_MEM_APM_REGION3_R2_R_M  (HP_MEM_APM_REGION3_R2_R_V << HP_MEM_APM_REGION3_R2_R_S)
#define HP_MEM_APM_REGION3_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION3_R2_R_S  10
/** HP_MEM_APM_REGION3_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION3_LOCK    (BIT(11))
#define HP_MEM_APM_REGION3_LOCK_M  (HP_MEM_APM_REGION3_LOCK_V << HP_MEM_APM_REGION3_LOCK_S)
#define HP_MEM_APM_REGION3_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION3_LOCK_S  11

/** HP_MEM_APM_REGION4_ADDR_START_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION4_ADDR_START_REG (DR_REG_HP_MEM_APM_BASE + 0x34)
/** HP_MEM_APM_REGION4_ADDR_START_L : HRO; bitpos: [11:0]; default: 0;
 *  Low 12 bit, start address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_START_L    0x00000FFFU
#define HP_MEM_APM_REGION4_ADDR_START_L_M  (HP_MEM_APM_REGION4_ADDR_START_L_V << HP_MEM_APM_REGION4_ADDR_START_L_S)
#define HP_MEM_APM_REGION4_ADDR_START_L_V  0x00000FFFU
#define HP_MEM_APM_REGION4_ADDR_START_L_S  0
/** HP_MEM_APM_REGION4_ADDR_START : R/W; bitpos: [18:12]; default: 0;
 *  Configures start address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_START    0x0000007FU
#define HP_MEM_APM_REGION4_ADDR_START_M  (HP_MEM_APM_REGION4_ADDR_START_V << HP_MEM_APM_REGION4_ADDR_START_S)
#define HP_MEM_APM_REGION4_ADDR_START_V  0x0000007FU
#define HP_MEM_APM_REGION4_ADDR_START_S  12
/** HP_MEM_APM_REGION4_ADDR_START_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  start address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_START_H    0x00001FFFU
#define HP_MEM_APM_REGION4_ADDR_START_H_M  (HP_MEM_APM_REGION4_ADDR_START_H_V << HP_MEM_APM_REGION4_ADDR_START_H_S)
#define HP_MEM_APM_REGION4_ADDR_START_H_V  0x00001FFFU
#define HP_MEM_APM_REGION4_ADDR_START_H_S  19

/** HP_MEM_APM_REGION4_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION4_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x38)
/** HP_MEM_APM_REGION4_ADDR_END_L : HRO; bitpos: [11:0]; default: 4095;
 *  Low 12 bit, end address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_END_L    0x00000FFFU
#define HP_MEM_APM_REGION4_ADDR_END_L_M  (HP_MEM_APM_REGION4_ADDR_END_L_V << HP_MEM_APM_REGION4_ADDR_END_L_S)
#define HP_MEM_APM_REGION4_ADDR_END_L_V  0x00000FFFU
#define HP_MEM_APM_REGION4_ADDR_END_L_S  0
/** HP_MEM_APM_REGION4_ADDR_END : R/W; bitpos: [18:12]; default: 127;
 *  Configures end address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_END    0x0000007FU
#define HP_MEM_APM_REGION4_ADDR_END_M  (HP_MEM_APM_REGION4_ADDR_END_V << HP_MEM_APM_REGION4_ADDR_END_S)
#define HP_MEM_APM_REGION4_ADDR_END_V  0x0000007FU
#define HP_MEM_APM_REGION4_ADDR_END_S  12
/** HP_MEM_APM_REGION4_ADDR_END_H : HRO; bitpos: [31:19]; default: 2064;
 *  High 13 bit,  end address of region 4.
 */
#define HP_MEM_APM_REGION4_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION4_ADDR_END_H_M  (HP_MEM_APM_REGION4_ADDR_END_H_V << HP_MEM_APM_REGION4_ADDR_END_H_S)
#define HP_MEM_APM_REGION4_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION4_ADDR_END_H_S  19

/** HP_MEM_APM_REGION4_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION4_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x3c)
/** HP_MEM_APM_REGION4_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_X    (BIT(0))
#define HP_MEM_APM_REGION4_R0_X_M  (HP_MEM_APM_REGION4_R0_X_V << HP_MEM_APM_REGION4_R0_X_S)
#define HP_MEM_APM_REGION4_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_X_S  0
/** HP_MEM_APM_REGION4_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_W    (BIT(1))
#define HP_MEM_APM_REGION4_R0_W_M  (HP_MEM_APM_REGION4_R0_W_V << HP_MEM_APM_REGION4_R0_W_S)
#define HP_MEM_APM_REGION4_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_W_S  1
/** HP_MEM_APM_REGION4_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_R    (BIT(2))
#define HP_MEM_APM_REGION4_R0_R_M  (HP_MEM_APM_REGION4_R0_R_V << HP_MEM_APM_REGION4_R0_R_S)
#define HP_MEM_APM_REGION4_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_R_S  2
/** HP_MEM_APM_REGION4_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_X    (BIT(4))
#define HP_MEM_APM_REGION4_R1_X_M  (HP_MEM_APM_REGION4_R1_X_V << HP_MEM_APM_REGION4_R1_X_S)
#define HP_MEM_APM_REGION4_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_X_S  4
/** HP_MEM_APM_REGION4_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_W    (BIT(5))
#define HP_MEM_APM_REGION4_R1_W_M  (HP_MEM_APM_REGION4_R1_W_V << HP_MEM_APM_REGION4_R1_W_S)
#define HP_MEM_APM_REGION4_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_W_S  5
/** HP_MEM_APM_REGION4_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_R    (BIT(6))
#define HP_MEM_APM_REGION4_R1_R_M  (HP_MEM_APM_REGION4_R1_R_V << HP_MEM_APM_REGION4_R1_R_S)
#define HP_MEM_APM_REGION4_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_R_S  6
/** HP_MEM_APM_REGION4_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_X    (BIT(8))
#define HP_MEM_APM_REGION4_R2_X_M  (HP_MEM_APM_REGION4_R2_X_V << HP_MEM_APM_REGION4_R2_X_S)
#define HP_MEM_APM_REGION4_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_X_S  8
/** HP_MEM_APM_REGION4_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_W    (BIT(9))
#define HP_MEM_APM_REGION4_R2_W_M  (HP_MEM_APM_REGION4_R2_W_V << HP_MEM_APM_REGION4_R2_W_S)
#define HP_MEM_APM_REGION4_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_W_S  9
/** HP_MEM_APM_REGION4_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_R    (BIT(10))
#define HP_MEM_APM_REGION4_R2_R_M  (HP_MEM_APM_REGION4_R2_R_V << HP_MEM_APM_REGION4_R2_R_S)
#define HP_MEM_APM_REGION4_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_R_S  10
/** HP_MEM_APM_REGION4_LOCK : R/W; bitpos: [11]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION4_LOCK    (BIT(11))
#define HP_MEM_APM_REGION4_LOCK_M  (HP_MEM_APM_REGION4_LOCK_V << HP_MEM_APM_REGION4_LOCK_S)
#define HP_MEM_APM_REGION4_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION4_LOCK_S  11

